In [112]:
import pandas as pd

In [113]:

df_weather=pd.read_csv('./weather.csv')
df_station=pd.read_csv('./station.csv')

In [114]:
df = pd.read_csv('./trip.csv',error_bad_lines=False)
df.head()

/home/dina/401labs/vg-stats/.venv/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3441: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)
b'Skipping line 50794: expected 12 fields, saw 20\n'

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_name,to_station_name,from_station_id,to_station_id,usertype,gender,birthyear
0,431,10/13/2014 10:31,10/13/2014 10:48,SEA00298,985.935,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1960.0
1,432,10/13/2014 10:32,10/13/2014 10:48,SEA00195,926.375,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1970.0
2,433,10/13/2014 10:33,10/13/2014 10:48,SEA00486,883.831,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Female,1988.0
3,434,10/13/2014 10:34,10/13/2014 10:48,SEA00333,865.937,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Female,1977.0
4,435,10/13/2014 10:34,10/13/2014 10:49,SEA00202,923.923,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1971.0

What is the average trip duration for a borrowed bicycle?

In [115]:
trip_average =df['tripduration'].mean()
trip_average

1178.2956753399776

What’s the most common age of a bicycle-sharer?

In [116]:
common_age= df['birthyear'].value_counts().idxmax()
age =2021-common_age 

age

34.0

Given all the weather data here, find the average precipitation per month, and the median precipitation

In [117]:

tuple_precipitation = df_weather['Precipitation_In'].mean()*30

median_precipitation_per_month = df_weather['Precipitation_In'].median()*30

print (f"({median_precipitation_per_month} ,{tuple_precipitation})")

(0.0 ,3.1519593613933234)

What’s the average number of bikes at a given bike station?

In [118]:
bike_station = round(df_station['install_dockcount'].mean())
bike_station

18

When a bike station is modified, is it more likely that it’ll lose bikes or gain bikes? How do you know?

Come up with 3 more questions that can be answered with this data set.

1-What are the top five hotter days at all?

In [119]:

weather =df_weather.sort_values('Max_Temperature_F', ascending=False).head()[['Date','Max_Temperature_F']]
weather

          Date  Max_Temperature_F
279  7/19/2015                 98
676  8/19/2016                 95
263   7/3/2015                 93
291  7/31/2015                 93
682  8/25/2016                 93

2- The most common gender in trips?

In [120]:
trip =df[["gender"]].mode()
trip

  gender
0   Male

3-what is the two minimum  temperature ?

In [121]:
min_temmp = df_weather.sort_values("Min_TemperatureF",ascending=True).head(3)
min_temmp

,Date,Max_Temperature_F,Mean_Temperature_F,Min_TemperatureF,Max_Dew_Point_F,MeanDew_Point_F,Min_Dewpoint_F,Max_Humidity,Mean_Humidity,Min_Humidity,...,Mean_Sea_Level_Pressure_In,Min_Sea_Level_Pressure_In,Max_Visibility_Miles,Mean_Visibility_Miles,Min_Visibility_Miles,Max_Wind_Speed_MPH,Mean_Wind_Speed_MPH,Max_Gust_Speed_MPH,Precipitation_In,Events
446,1/2/2016,44,34.0,23,30,23,13,96,73,33,...,30.19,30.11,10,9,6,8,2,NaN,0.0,NaN
445,1/1/2016,44,34.0,25,30,25,21,92,76,43,...,30.38,30.27,10,10,6,5,1,NaN,0.0,NaN
411,11/28/2015,46,36.0,26,31,26,21,86,75,50,...,30.29,30.22,10,8,2,6,1,NaN,0.0,Snow

## Test